HW0 [Data 198]

In [34]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import os

In [41]:
df = pd.read_csv("/Users/danhwang/data198-sp23/Data198-SP23./data/Mexico.csv")
df

,year,state,sector,sex,age,ind_lang,educ_years,hrs_wk,inc_m,USDist_km
0,2010,1,Services,1,30,0,12,48,3600,600.6932
1,2010,1,Services,0,16,0,9,98,4286,557.6143
2,2010,1,Agriculture,0,19,0,10,24,1286,616.0118
3,2010,1,Manufacturing,0,29,0,12,45,4286,550.4415
4,2010,1,Services,0,38,0,9,40,4600,597.9345